#pragma once
namespace shp {
    struct Point {
        int x;
        int y;
    };
    // 数据结构：[形状类型 0-6][旋转状态 0-3][4个点][x,y坐标]
    const int DATA[7][4][4][2] = {
        // 0: I (长条)
        {
            {{0,1}, {1,1}, {2,1}, {3,1}}, // 0度 (横着)
            {{2,0}, {2,1}, {2,2}, {2,3}}, // 90度 (竖着)
            {{0,2}, {1,2}, {2,2}, {3,2}}, // 180度
            {{1,0}, {1,1}, {1,2}, {1,3}}  // 270度
        },
        // 1: O (田字) - 四个方向坐标其实是一样的
        {
                    {{1,0}, {2,0}, {1,1}, {2,1}}, {{1,0}, {2,0}, {1,1}, {2,1}},
                    {{1,0}, {2,0}, {1,1}, {2,1}}, {{1,0}, {2,0}, {1,1}, {2,1}}
        },
        // 2: T (凸起)
        {
                    {{1,0}, {0,1}, {1,1}, {2,1}}, //  .T. / TTT
                    {{1,0}, {1,1}, {2,1}, {1,2}}, //  .T. / .TT / .T.
                    {{0,1}, {1,1}, {2,1}, {1,2}}, //  ... / TTT / .T.
                    {{1,0}, {0,1}, {1,1}, {1,2}}  //  .T. / TT. / .T.
        }
        // ... 其他形状 (L, J, S, Z) 依此类推
    };
    inline void Get(int type, int rotation, Point outPoints[4]) {
        int t = (type < 0) ? 0 : (type % 7);
        int r = (rotation < 0) ? 0 : (rotation % 4);

        for (int i = 0; i < 4; i++) {
            outPoints[i].x = DATA[t][r][i][0];
            outPoints[i].y = DATA[t][r][i][1];
        }
    }


}
